tap "colecaccamise/local-tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "snaipe/soft"
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "python@3.12"
brew "glib"
brew "autoconf"
brew "automake"
brew "gmp"
brew "coreutils"
brew "criterion"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "gcc"
brew "gcovr"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "gtk+3"
brew "libheif"
brew "libraw"
brew "libtool"
brew "imagemagick"
brew "libksba"
brew "libyaml"
brew "llvm"
brew "mailhog", restart_service: true
brew "node"
brew "openssl@1.1"
brew "mysql@5.7", restart_service: true
brew "pkg-config"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "tldr"
brew "zlib"
brew "mongodb/brew/mongodb-community"
cask "alt-tab"
cask "devtoys"
cask "hiddenbar"
cask "itsycal"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "atomiks.moonlight"
vscode "bakrimoharram.purple-blue-dark"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dericcain.react-components"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ekelley.midnight-synth"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hridoy.rails-snippets"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.gitignore"
vscode "mongodb.mongodb-vscode"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nichabosh.minimalist-dark"
vscode "nycdude.nyc-lights"
vscode "partkyle.paste-and-indent"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "robbowen.synthwave-vscode"
vscode "roee.arrow-function-converter"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "sianglim.slim"
vscode "snlbaral.express-mongo-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "twxs.cmake"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
